<div class="col-md-8" style="overflow: auto">
    <p>
        Cron jobs
        یک راه عالی برای اجرای خودکار دستورات برنامه ریزی شده در سیستم عامل است.
        دستور Cron از پنج بخش تشکیل شده است که در جدول زیر به صورت کامل توضیح داده شده است.
        در این دستور هر یک از ستاره ها برای ایجاد زمانبندی در بازه های دقیقه، ساعت، روزانه و
        ماهانه است، مثلا دستور زیر در اول هر ماه ساعت 00:00 اجرا میشود.
        <br/>
        0 0 1 * *
        <br/>
        از سایت
        <a href="https://crontab.guru/">crontab</a>
        و
        <a href="https://crontab-generator.org/">crontab-generator</a>

        نیز برای ساخت زمان اجرای دستورات کرون جاب می توانید استفاده کنید.
    </p>
    <table class="table table-bordered " style="border-color: #0b0b0b;">
        <tbody>
        <tr>
            <td><strong>فیلد ها</strong></td>
            <td><strong>مقدار های مجاز قابل استفاده برای فیلد</strong></td>
            <td><strong>دستور</strong></td>
            <td><strong>توضیح</strong></td>
        </tr>
        <tr>
            <td>[a] – دقیقه</td>
            <td>0 – 59</td>
            <td>* * * * 7</td>
            <td>هر زمان که دقیقه ی ساعت بر روی 7 باشد کرون جاب اجرا میگردد.<p></p>
            </td>
        </tr>
        <tr>
            <td>[b] – ساعت</td>
            <td>0 – 23</td>
            <td>* * * 7 0</td>
            <td>کرون جاب تعریف شده هر روز ساعت 7 صبح و 7 شب اجرا می شود.<p></p>
            </td>
        </tr>
        <tr>
            <td>[c] – روز</td>
            <td>0 – 31</td>
            <td>* * 7 0 0</td>
            <td>کرون جاب روز هفتم هر ماه اجرا می شود.<p></p>
            </td>
        </tr>
        <tr>
            <td>[d] – ماه</td>
            <td>0 = نامشخص و 12 = ماه دسامبر</td>
            <td>* 7 0 0 0</td>
            <td>کرون جاب تنها در ماه جولای که ماه هفتم سال میلادی می باشد یک مرتبه اجرا
                میگردد.<p></p>
            </td>
        </tr>
        <tr>
            <td>[e] – روزهای هفته</td>
            <td>0 = شنبه و 7 = شنبه</td>
            <td>7 * * 0 0</td>
            <td>کرون جاب در روز شنبه هر هفته اجرا میگردد.<p></p>

            </td>
        </tr>
        </tbody>
    </table>
</div>
