<?php

namespace Database\Seeders\OldSeeder;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class MessageTypeSeeder extends Seeder
{
    private $data = [
        //
        [ "id" => 100, "caption" => 'شرح درخواست در فایل سفارش نوسا ' ],
        [ "id" => 110, "caption" => 'شرح برگه در فایل سفارش نوسا ' ],
        [ "id" => 120, "caption"=>   "شرح جدول لاگ"],
        [ "id" => 130, "caption"=>   "ثبت فرم ورود و خروج از انبار"],
        [ "id" => 140, "caption"=>   "انبار گردانی"],
        [ "id" => 150, "caption"=>   "بارگیری"],
        [ "id" => 160, "caption"=>   "ماشین ها"],
        [ "id" => 170, "caption"=>   "فرم تولید"],
        [ "id" => 180, "caption"=>   "کارت تولید"],
        [ "id" => 190, "caption"=>   "فرم بسته بندی"],
        [ "id" => 200, "caption"=>   "مرخصی"],
        [ "id" => 210, "caption"=>   "مرجوعی کالا"],
        [ "id" => 220, "caption"=>   "طراحی کالا"],
        [ "id" => 230, "caption"=>   "فرم خروج/درخواست خروج از انبار "],
        [ "id" => 231, "caption"=>   "فرم خروج ویژه دوره پیاده سازی "],
        [ "id" => 240, "caption"=>   "حمل و نقل "],
        [ "id" => 250, "caption"=>   "لاگ مصرف واقعی "],
        [ "id" => 260, "caption"=>   "مجوزها "],
        [ "id" => 270, "caption"=>   "انبارگردانی "],
        [ "id" => 280, "caption"=>   "درخواست همکاری "],
        [ "id" => 290, "caption"=>   "تکمیل اطلاعات فرم ورود به انبار "],
        [ "id" => 300, "caption"=>   "ارزیابی عملکرد "],
        [ "id" => 310, "caption"=>   "پیام های مربوط به ارزیابی عملکرد "],
        [ "id" => 320, "caption"=>   "پیام های مجوز جمع شدگی "],
        [ "id" => 330, "caption"=>   "اطلاعات اضافه برای درخواست های خروج از انبار "],
        [ "id" => 340, "caption"=>   "اطلاعات اضافه برای فرم های انبار "],
        [ "id" => 350, "caption"=>   "لیست فرم های ورودی که برای یک برگ خروج صادر شده است. "],
        [ "id" => 360, "caption"=>   "تخصیص مجدد تخصیص های خاتمه یافته، در صورت نیاز"],
        [ "id" => 370, "caption"=>   "اطلاعات موقت کنترل کیفیت بسته بندی "],
        [ "id" => 380, "caption"=>   "ثبت نام مستقیم در داشبورد همکاری با ما "],
        [ "id" => 390, "caption"=>   "لیست بسته بندی ها جهت تغییر بسته بندی سریع "],
        [ "id" => 400, "caption"=>   "افزودن بسته بندی به پالت "],
        [ "id" => 405, "caption"=>   "کسر کردن بسته بندی از پالت "],


        [ "id" => 501, "caption"=>   "اطلاعات جستجو در داشبورد سفارش "],
        [ "id" => 601, "caption"=>   "اطلاعات ذخیره شده برای انتخاب بسته بندی ها در تخصیص پیمانکار "],
        [ "id" => 602, "caption"=>   "اطلاعات ذخیره شده برای انتخاب بسته بندی ها در تخصیص سریع پیمانکار "],

        [ "id" => 700, "caption"=>   "اطلاعات فایل اکسل جهت بارگذاری اطلاعات تولید در ماژول ProductModule1"],

        [ "id" => 800, "caption"=>   "اطلاعات جستجو در داشبورد تولید با جزئیات "],
        [ "id" => 810, "caption"=>   "اطلاعات جستجو در داشبورد برنامه ریزی کانال تولید ها "],
    ];
    private $table = 'message_types';

    public function run() {
        DB::table( $this->table )->delete();
        foreach ( $this->data as $item ) {
            DB::table( $this->table )->insert( $item );
        }
    }
}
