<?php

namespace Database\Seeders\OldSeeder;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class StatusSeeder extends Seeder
{
    // 0000 00000
    private $data = [
        // order and product 0-1000
        ["id" => 100, "caption" => ' جاري ', "status_type_id" => 100],
        ["id" => 110, "caption" => ' خاتمه يافته ', "status_type_id" => 100],

        // جدوال فراخوانی
        //  وضعیت در جدول OrderList status_id
        ["id" => 300, "caption" => "در انتظار پردازش", "status_type_id" => 300],
        ["id" => 301, "caption" => " پردازش شده", "status_type_id" => 300],
        ["id" => 302, "caption" => " پردازش نشده", "status_type_id" => 300],
        ["id" => 303, "caption" => "  خطا! کالا یافت نشد.", "status_type_id" => 300],
        ["id" => 388, "caption" => ' در حال پردازش - گام 1  ', "status_type_id" => 300],
        ["id" => 389, "caption" => ' در حال پردازش - گام 2  ', "status_type_id" => 300],
        ["id" => 390, "caption" => ' در حال پردازش - گام 3  ', "status_type_id" => 300],
        ["id" => 391, "caption" => ' در حال پردازش - گام 4  ', "status_type_id" => 300],
        ["id" => 392, "caption" => ' 5  ', "status_type_id" => 300],

        // erp_status_id
        ["id" => 304, "caption" => " درانتظار دریافت تاییده ها ", "status_type_id" => 300],
        ["id" => 305, "caption" => "در انتظار آماده سازی ", "status_type_id" => 300],
        ["id" => 310, "caption" => " خاتمه یافته قبل از شروع", "status_type_id" => 300],
        ["id" => 320, "caption" => " خاتمه یافته", "status_type_id" => 300],
        ["id" => 322, "caption" => " خاتمه یافته - کارت فرعی", "status_type_id" => 300],
        ["id" => 340, "caption" => "ارسال شده با باقی مانده", "status_type_id" => 300],
        ["id" => 350, "caption" => " ارسال شده ", "status_type_id" => 300],
        ["id" => 355, "caption" => " توقف فروش  ", "status_type_id" => 300],
        ["id" => 360, "caption" => " در انتظار بارگیری  ", "status_type_id" => 300],
        ["id" => 365, "caption" => "   غیر قابل بارگیری AI Option   ", "status_type_id" => 300],
        ["id" => 370, "caption" => " خاتمه یافته ( اپراتور) ", "status_type_id" => 300],

        // وضعیت عملیات های بزرگ
        ["id" => 3500001, "caption" => "در انتظار شروع عملیات", "status_type_id" => 3500],
        ["id" => 3500002, "caption" => "عملیات پایان یافته", "status_type_id" => 3500],
        ["id" => 3500003, "caption" => "اجرای عملیات ناموفق", "status_type_id" => 3500],

        // وضعیت پرداخت ها جهت شارژ پیامک و ... برای سامانه
        ["id" => 3600001, "caption" => "در انتظار تایید", "status_type_id" => 3600],
        ["id" => 3600004, "caption" => "تایید شده", "status_type_id" => 3600],
        ["id" => 3600005, "caption" => "عدم تایید (تراکنش ناموفق)", "status_type_id" => 3600],

        // وضعیت مشتری
        ["id" => 2001001, "caption" => "در انتظار ثبت اطلاعات پایه", "status_type_id" => 2001],
        ["id" => 2001002, "caption" => "در انتظار ثبت اطلاعات مرحله دوم", "status_type_id" => 2001],
        ["id" => 2001100, "caption" => "مشتری فعال", "status_type_id" => 2001],

        # وضعیت کاربران
        ["id" => 2002001, "caption" => "ثبت نام موفق", "status_type_id" => 2002],
        ["id" => 2002002, "caption" => "در حال ثبت نام مشتری", "status_type_id" => 2002],

        // وضعیت جدول Orders
        ["id" => 304010, "caption" => "تایید پیش نویس سفارش", "status_type_id" => 351],
        ["id" => 304020, "caption" => "تایید کارشناس فروش", "status_type_id" => 351],
        ["id" => 304030, "caption" => "تایید پیش فاکتور توسط مشتری", "status_type_id" => 351],
        ["id" => 304040, "caption" => "تایید کارشناس وصول مطالبات", "status_type_id" => 351],
        ["id" => 304050, "caption" => "تایید مدیر فروش", "status_type_id" => 351],
        ["id" => 304060, "caption" => "تایید مدیر  مالی", "status_type_id" => 351],
        ["id" => 304070, "caption" => "تایید مدیر عامل", "status_type_id" => 351],
        ["id" => 304075, "caption" => "تایید هئیت مدیره", "status_type_id" => 351],
        ["id" => 304080, "caption" => "تایید پردازش ", "status_type_id" => 351],

        ["id" => 35010, "caption" => "خاتمه یافته قبل از شروع", "status_type_id" => 350],
        ["id" => 35030, "caption" => "در انتظار آماده سازی", "status_type_id" => 350],
        ["id" => 35040, "caption" => "ارسال ناقص", "status_type_id" => 350],
        ["id" => 35050, "caption" => "ارسال شده", "status_type_id" => 350],
        ["id" => 35060, "caption" => "خاتمه یافته", "status_type_id" => 350],
        ["id" => 35065, "caption" => "کنسل شده", "status_type_id" => 350],
        ["id" => 35070, "caption" => " خاتمه یافته ( اپراتور) ", "status_type_id" => 350],
        ["id" => 35075, "caption" => " خاتمه یافته ( ارسال نشده) ", "status_type_id" => 350],
        ["id" => 35078, "caption" => " خاتمه یافته ( ارسال ناقص) ", "status_type_id" => 350],

        ["id" => 35090, "caption" => " در انتظار تایید برگ خروج ", "status_type_id" => 350],



        ["id" => 35095, "caption" => "در انتظار پرداخت صورت حساب", "status_type_id" => 350],
        ["id" => 35096, "caption" => "صورت حساب پرداخت شده", "status_type_id" => 350],
        ["id" => 35097, "caption" => "عدم پرداخت صورت حساب", "status_type_id" => 350],


        ["id" => 305001, "caption" => " در انتظار دانلود", "status_type_id" => 305],
        ["id" => 305002, "caption" => " در انتظار پرینت", "status_type_id" => 305],
        ["id" => 305003, "caption" => " خاتمه یافته", "status_type_id" => 305],

        // بارگیری
        ["id" => 35030010, "caption" => "صدور دستور جمع آوری", "status_type_id" => 352],
        ["id" => 35030020, "caption" => "جمع آوری", "status_type_id" => 352],
        ["id" => 35030030, "caption" => "درخواست کامیون", "status_type_id" => 352],
        ["id" => 35030040, "caption" => "اعلام آمادگی کامیون", "status_type_id" => 352],
        ["id" => 35030050, "caption" => "ورود کامیون", "status_type_id" => 352],
        ["id" => 35030060, "caption" => "بارگیری", "status_type_id" => 352],
        ["id" => 35030070, "caption" => "خروج کامیون", "status_type_id" => 352],
        ["id" => 35030080, "caption" => "دریافت مشتری", "status_type_id" => 352],

        // وضعیت طراحی کالا
        ["id" => 3400001, "caption" => "کالای مصرفی طراحی شده است", "status_type_id" => 3400],
        ["id" => 3400002, "caption" => "در حال طراحی کالای مصرفی", "status_type_id" => 3400],


        // وضعیت شروع عملیات با توجه به مسیر محصول قبلی
        ["id" => 3410002, "caption" => "همزمان با شروع عملیات ماشین قبلی در مسیر محصول، عملیات ماشین شروع می شود؟ (StartToStart)","caption2"=>"StartToStart", "status_type_id" => 3410],
        ["id" => 3410001, "caption" => "پس از پایان عملیات ماشین قبلی در مسیر محصول، عملیات ماشین شروع می شود؟ (EndToStart)","caption2"=>"EndToStart", "status_type_id" => 3410],


        // جدول مواد اولیه request_from_warehouse
        ["id" => 380, "caption" => " در انتظار تحویل ", "status_type_id" => 380],
        ["id" => 382, "caption" => " کنسل شده ", "status_type_id" => 380],
        ["id" => 384, "caption" => "تحویل شده با باقی مانده", "status_type_id" => 380],
        ["id" => 386, "caption" => "تحویل شده", "status_type_id" => 380],
        ["id" => 387, "caption" => " در انتظار برگ خرید", "status_type_id" => 380],
        ["id" => 386001, "caption" => "خاتمه یافته", "status_type_id" => 380],

        ["id" => 380010, "caption" => "ثبت درخواست کالا از انبار", "status_type_id" => 380],

        // وضعیت اجرای ماژول ها
        ["id" => 410100, "caption" => "پایان اجرا و در انتظار فرمان اجرای بعدی", "status_type_id" => 410],
        ["id" => 410300, "caption" => "در حال اجرای یک عملیات", "status_type_id" => 410],
        ["id" => 410400, "caption" => "پایان عملیات", "status_type_id" => 410],
        ["id" => 410500, "caption" => "راه اندازی اتومات", "status_type_id" => 410],

        // وضعیت وجود داشتن بسته در انبار
        ["id" => 4201, "caption" => "بسته داخل انبار است", "status_type_id" => 420],
        ["id" => 4202, "caption" => "بسته خارج انبار است", "status_type_id" => 420],
        ["id" => 4203, "caption" => "بسته در مسیر تحویل به درخواست دهنده است", "status_type_id" => 420],
        ["id" => 4204, "caption" => "بسته  در مسیر تحویل به انبار است", "status_type_id" => 420],
        ["id" => 4205, "caption" => "بسته داخل بسته بزرگتر است", "status_type_id" => 420],
        ["id" => 4206, "caption" => "بسته های تغییر یافته است", "status_type_id" => 420],
        ["id" => 4207, "caption" => "در حال نقل و انتقال", "status_type_id" => 420],


        // وضعیت کارت تولید
        ["id" => 500, "caption" => "در انتظار", "status_type_id" => 500],
        ["id" => 510, "caption" => " کنسل شده ", "status_type_id" => 500],
        ["id" => 520, "caption" => "خاتمه یافته", "status_type_id" => 500],
        ["id" => 530, "caption" => " خاتمه یافته (جایگزین)", "status_type_id" => 50011],

        ["id" => 540, "caption" => "ویرایش کارت تولید", "status_type_id" => 50011],
        ["id" => 545, "caption" => "ویرایش شیف های کاری", "status_type_id" => 50011],
        ["id" => 550, "caption" => "صدور کارت فرعی", "status_type_id" => 50011],

        ["id" => 50012001, "caption" => "رزور شده", "status_type_id" => 50012],

        // وضعیت کارت تولید رزرو
        ["id" => 55001, "caption" => "در انتظار", "status_type_id" => 550],


// پارچه خام


        // loading status

        ["id" => 601, "caption" => " قابل بارگیری ", "status_type_id" => 600],
        ["id" => 602, "caption" => " غیر قابل بارگیری ", "status_type_id" => 600],

        // وضعیت های تاهل

        ["id" => 651, "caption" => " مجرد ", "status_type_id" => 650],
        ["id" => 652, "caption" => " متاهل", "status_type_id" => 650],
        ["id" => 653, "caption" => " بی همسر (بر اثر طلاق)", "status_type_id" => 650],
        ["id" => 654, "caption" => " بی همسر (بر اثر فوت)", "status_type_id" => 650],

        // product from 1000- 2000,
        ["id" => 1200, "caption" => " فعال ", "status_type_id" => 1100],
        ["id" => 1210, "caption" => " غیر فعال ", "status_type_id" => 1100],


        // On-Off Status
        ["id" => 53001, "caption" => " روشن ", "status_type_id" => 5300],
        ["id" => 53002, "caption" => " خاموش  ", "status_type_id" => 5300],


        //call status
        ["id" => 3300, "caption" => "شروع نشده", "status_type_id" => 3300],
        ["id" => 3310, "caption" => "در حال انجام", "status_type_id" => 3300],
        ["id" => 3320, "caption" => "پایان یافته", "status_type_id" => 3300],
        ["id" => 3325, "caption" => " / فراخوانی ناموفق بارگذاری ها انجام نشده است  ", "status_type_id" => 3300],
        ["id" => 3330, "caption" => "بارگذاری شده", "status_type_id" => 3300],
        ["id" => 3340, "caption" => "در انتظار بارگذاری", "status_type_id" => 3300],

        //وضیعت کانال تولید ماشین
        ["id" => 3358001, "caption" => " جاری", "status_type_id" => 3358],
        ["id" => 3358002, "caption" => " رزرو", "status_type_id" => 3358],
        ["id" => 3358003, "caption" => "  تولید شده", "status_type_id" => 3358],
        ["id" => 3358004, "caption" => " کنسل شده", "status_type_id" => 3358],


        //وضیعت نیاز به تعویص ورودی های ماشین
        ["id" => 3359001, "caption" => " نیاز به تعویض نامشخص است.", "status_type_id" => 3359],
        ["id" => 3359002, "caption" => " نیاز به تعویض دارد", "status_type_id" => 3359],


        // PurchaseOrderProduct

        ["id" => 4400, "caption" => "در انتظار سفارش گذاری ", "status_type_id" => 4400],
        ["id" => 4410, "caption" => "سفارش گذاری شده", "status_type_id" => 4400],

        // وضعیت خرید محصولات فروشگاه
        ["id" => 4500001, "caption" => "در انتظار خرید", "status_type_id" => 4500],
        ["id" => 4500002, "caption" => "خریداری شده در انتظار انجام تنظیمات", "status_type_id" => 4500],
        ["id" => 4500003, "caption" => "تکمیل خرید", "status_type_id" => 4500],

        //  ["id"=>4600, "caption"=>"مجوز خروج انبار برای orders"]

        ["id" => 460000100, "caption" => " مجوز  ندارد ", "status_type_id" => 4600],
        ["id" => 460000200, "caption" => "مجوز  دارد", "status_type_id" => 4600],

        ["id" => 461000100, "caption" => " ندارد ", "status_type_id" => 4610],
        ["id" => 461000200, "caption" => " دارد", "status_type_id" => 4610],

        ["id" => 4620001, "caption" => " حاضر در محل کار", "status_type_id" => 4620],
        ["id" => 4620003, "caption" => "مرخصی ", "status_type_id" => 4620],
        ["id" => 4620005, "caption" => "غیبت", "status_type_id" => 4620],
      //  ["id" => 4620006, "caption" => "در حال استخدام", "status_type_id" => 4620], تکراری
        ["id" => 4620007, "caption" => "قطع همکاری", "status_type_id" => 4620],
        ["id" => 4620008, "caption" => "خارج از سازمان", "status_type_id" => 4620],
//        [ "id" => 4620009, "caption" => "قطع همکاری (حذف)", "status_type_id" => 4620 ],
        ["id" => 4620010, "caption" => "ماموریت", "status_type_id" => 4620],
        ["id" => 4620011, "caption" => "اضافه کاری", "status_type_id" => 4620],
        ["id" => 4620012, "caption" => "در انتظار شروع همکاری", "status_type_id" => 4620],
        ["id" => 4620013, "caption" => "در انتظار بررسی مشخصات فردی", "status_type_id" => 4620],
        ["id" => 4620014, "caption" => "در حال استخدام", "status_type_id" => 4620],

        // وضعیت درخواست همکاری
        ["id" => 4640100, "caption" => "در انتظار تایید مشخصات مرحله اول (کارمند)", "status_type_id" => 4640],
        ["id" => 4640101, "caption" => "در انتظار شروع", "status_type_id" => 4640],
        ["id" => 4640102, "caption" => "در انتظار هماهنگی", "status_type_id" => 4640],
        ["id" => 4640103, "caption" => "در انتظار انجام", "status_type_id" => 4640],
        ["id" => 4640104, "caption" => "انجام شده", "status_type_id" => 4640],
        ["id" => 4640105, "caption" => "عدم تایید", "status_type_id" => 4640],
        ["id" => 4640106, "caption" => "آغاز همکاری", "status_type_id" => 4640],
        ["id" => 4640107, "caption" => "در انتظار بارگذاری مدارک (مرحله دوم)", "status_type_id" => 4640],
        ["id" => 4640108, "caption" => "در انتظار اصلاح فرم درخواست", "status_type_id" => 4640],
        ["id" => 4640109, "caption" => "در انتظار تایید بارگذاری مدارک", "status_type_id" => 4640],
        ["id" => 4640110, "caption" => "در انتظار تنظیم پیش نویس قرارداد هوشمند (تامین کننده)", "status_type_id" => 4640],
        ["id" => 4640111, "caption" => "در انتظار تایید اولیه قرارداد هوشمند (تامین کننده)", "status_type_id" => 4640],
        ["id" => 4640112, "caption" => "در انتظار تایید نهایی قرارداد هوشمند (تامین کننده)", "status_type_id" => 4640],
        ["id" => 4640113, "caption" => "در انتظار تایید قرارداد توسط (تامین کننده)", "status_type_id" => 4640],
        ["id" => 4640114, "caption" => "در انتظار ثبت مرکز هزینه (تامین کننده)", "status_type_id" => 4640],
        ["id" => 4640115, "caption" => "در انتظارتایید قرارداد توسط (کارمند) ", "status_type_id" => 4640],
        ["id" => 4640116, "caption" => "در انتظارتایید مشخصات مرحله دوم (کارمند) ", "status_type_id" => 4640],
        ["id" => 4640117, "caption" => "در انتظارتحویل مدارک به بایگانی (کارمند) ", "status_type_id" => 4640],
        ["id" => 4640118, "caption" => "در انتظارثبت طب کار (کارمند) ", "status_type_id" => 4640],
        ["id" => 4640119, "caption" => "آغاز همکاری در انتظار تعریف اطلاعات مالی (کارمند) ", "status_type_id" => 4640],
        ["id" => 4640120, "caption" => "آغاز همکاری در انتظار دریافت حساب اینترنت (کارمند) ", "status_type_id" => 4640],
        ["id" => 4640121, "caption" => "در انتظار ثبت اطلاعات بانکی (کارمند)", "status_type_id" => 4640],
        ["id" => 4640122, "caption" => "در انتظار تنظیم پیش نویس قرارداد هوشمند (مشتری)", "status_type_id" => 4640],
        ["id" => 4640123, "caption" => "در انتظار تایید قرارداد توسط (مشتری)", "status_type_id" => 4640],
        ["id" => 4640124, "caption" => "در انتظار تایید اولیه پیش نویس قرارداد هوشمند (مشتری)", "status_type_id" => 4640],
        ["id" => 4640125, "caption" => "در انتظار تایید نهایی پیش نویس قرارداد هوشمند (مشتری)", "status_type_id" => 4640],
        ["id" => 4640126, "caption" => "در انتظار ثبت مرکز هزینه (مشتری)", "status_type_id" => 4640],
        ["id" => 4640127, "caption" => "در انتظارتحویل قراداد به بایگانی توسط (مشتری)", "status_type_id" => 4640],
        ["id" => 4640128, "caption" => "در انتظارتحویل قراداد به بایگانی توسط (تامین کننده)", "status_type_id" => 4640],
        ["id" => 4640129, "caption" => "در انتظار تنظیم پیش نویس قرارداد هوشمند (پیمانکار)", "status_type_id" => 4640],
        ["id" => 4640130, "caption" => "در انتظار تایید اولیه پیش نویس قرارداد هوشمند (پیمانکار)", "status_type_id" => 4640],
        ["id" => 4640131, "caption" => "در انتظار تایید نهایی پیش نویس قرارداد هوشمند (پیمانکار)", "status_type_id" => 4640],
        ["id" => 4640132, "caption" => "در انتظار تایید قرارداد توسط (پیمانکار)", "status_type_id" => 4640],
        ["id" => 4640133, "caption" => "در انتظار ثبت مرکز هزینه (پیمانکار)", "status_type_id" => 4640],
        ["id" => 4640134, "caption" => "در انتظارتحویل قراداد به بایگانی توسط (پیمانکار)", "status_type_id" => 4640],
        ["id" => 4640135, "caption" => "در انتظارتایید نمایندگی", "status_type_id" => 4640],
        ["id" => 4640136, "caption" => "در انتظارتایید پیش نویس اطلاعات (مشتری)", "status_type_id" => 4640],
        ["id" => 4640137, "caption" => "در انتظارتایید  پیش نویس اطلاعات (پیمانکار)", "status_type_id"=> 4640],
        ["id" => 4640138, "caption" => "در انتظارتایید  پیش نویس اطلاعات (تامین کننده)", "status_type_id" => 4640],

        ["id" => 4640139, "caption" => "در انتظار تایید مشخصات مرحله اول (مشتری)", "status_type_id" => 4640],
        ["id" => 4640140, "caption" => "در انتظار تایید مشخصات مرحله اول (پیمانکار)", "status_type_id" => 4640],
        ["id" => 4640141, "caption" => "در انتظار تایید مشخصات مرحله اول (تامین کننده)", "status_type_id" => 4640],

        ["id" => 4640201, "caption" => "در انتظار تحویل مدارک", "status_type_id" => 4640],

        ["id" => 4640301, "caption" => "در حال تکمیل فرم درخواست", "status_type_id" => 4640],
        // برای تایید گام ها
        ["id" => 4641401, "caption" => "در انتظار تایید اطلاعات", "status_type_id" => 4641],
        ["id" => 4641402, "caption" => "اطلاعات تایید شده", "status_type_id" => 4641],
        ["id" => 4641403, "caption" => "عدم تایید ", "status_type_id" => 4641],
        ["id" => 4641404, "caption" => "عدم نیاز به تایید", "status_type_id" => 4641],

        ["id" => 4642002, "caption" => " تایید نماینده", "status_type_id" => 4642],
        // وضعیت ارزیابی عملکرد
        ["id" => 4650001, "caption" => "در انتظار ارزیابی", "status_type_id" => 4650],
        ["id" => 4650002, "caption" => "ارزیابی شده", "status_type_id" => 4650],



        // وضعیت های مرخصی
        ["id" => 4630001, "caption" => "در انتظار تایید جانشین", "status_type_id" => 4630],
        ["id" => 4630002, "caption" => "در انتظار تایید مافوق", "status_type_id" => 4630],
        ["id" => 4630003, "caption" => "تایید شده", "status_type_id" => 4630],
        ["id" => 4630004, "caption" => "عدم تایید", "status_type_id" => 4630],
        ["id" => 4630005, "caption" => "انصراف", "status_type_id" => 4630],
        ["id" => 4630006, "caption" => "در حال انجام", "status_type_id" => 4630],
        ["id" => 4630007, "caption" => "انجام شده", "status_type_id" => 4630],
        ["id" => 4630008, "caption" => "عدم تایید جانشین", "status_type_id" => 4630],
        ["id" => 4630009, "caption" => "در انتظار ثبت توضیح", "status_type_id" => 4630],


        // جدول form
        ["id" => 500000100, "caption" => "عدم تایید ", "status_type_id" => 5000],
        ["id" => 500000110, "caption" => "در انتظار بررسی تراکنش های انبار ", "status_type_id" => 5000],
        ["id" => 500000150, "caption" => "در انتظار ثبت تراکنش انبار", "status_type_id" => 5000],
        ["id" => 500000200, "caption" => "تایید شده", "status_type_id" => 5000],
        ["id" => 500000300, "caption" => " ویرایش شده", "status_type_id" => 5000],
        ["id" => 500000400, "caption" => " در انتظار تحویل به انبار", "status_type_id" => 5000],
        ["id" => 500000410, "caption" => " در انتظار تایید انبار", "status_type_id" => 5000],
        ["id" => 500000420, "caption" => " در انتظار مغایرت گیری", "status_type_id" => 5000],
        ["id" => 500000430, "caption" => "در انتظار تکمیل اطلاعات ", "status_type_id" => 5000], //
        ["id" => 500000450, "caption" => "در حال پردازش اطلاعات تکمیلی ", "status_type_id" => 5000], //
        ["id" => 500000455, "caption" => "در انتظار پردازش جهت نرمال کردن مقدار بسته بندی ها ", "status_type_id" => 5000], //

        ["id" => 500000500, "caption" => "در انتظار تایید درخواست کننده", "status_type_id" => 5000],
//        [ "id" => 500000510, "caption" => "تحویل شده", "status_type_id" => 5000 ], // حذف
        ["id" => 500000514, "caption" => "در انتظار تایید (وصول مطالبات)", "status_type_id" => 5000], //
        ["id" => 500000515, "caption" => "در انتظار تایید پیش نویس (واحد مالی)", "status_type_id" => 5000], //
        ["id" => 500000520, "caption" => "در انتظار تایید نهایی (واحد مالی)", "status_type_id" => 5000], //
        ["id" => 500000525, "caption" => "در انتظار ارسال (بارگیری)", "status_type_id" => 5000], //
        ["id" => 500000530, "caption" => "در انتظار خروج (نگهبانی)", "status_type_id" => 5000], //
        ["id" => 500000535, "caption" => "در انتظار تایید (کنترل کیفیت)", "status_type_id" => 5000], //

        ["id" => 500000600, "caption" => "مرجوع شده (مشتری)", "status_type_id" => 5000], //
        // وضعیت های فرم انبار جهت ورود به کارخانه
//        [ "id" => 500000700, "caption" => "در انتظار دریافت بار (بارگیری)", "status_type_id" => 5000 ], //
        ["id" => 500000710, "caption" => "در انتظار ورود (نگهبانی)", "status_type_id" => 5000], //
        ["id" => 500000720, "caption" => "در انتظار ارسال به کارفرما", "status_type_id" => 5000], //


        // جدول FormGeneralItem
        ["id" => 5002001, "caption" => "معلق", "status_type_id" => 5002],
        ["id" => 5002002, "caption" => "در انتظار تفکیک", "status_type_id" => 5002],
        ["id" => 5002003, "caption" => "تفکیک شده", "status_type_id" => 5002],
        ["id" => 5002004, "caption" => "عدم تایید", "status_type_id" => 5002],
        ["id" => 5002005, "caption" => "عدم نیاز به تفکیک ( ذخیره کالای مصرفی سفارش)", "status_type_id" => 5002],
        ["id" => 5002006, "caption" => " در انتظار تخلیه بار", "status_type_id" => 5002],
        ["id" => 5002007, "caption" => " پایان تخلیه در انتظار ثبت تراکنش", "status_type_id" => 5002],

        // وضعیت کنترل کیفی
        ["id" => 5003001, "caption" => "نامشخص", "status_type_id" => 5003],
        ["id" => 5003002, "caption" => "تایید کنترل کیفی", "status_type_id" => 5003],
        ["id" => 5003003, "caption" => "عدم تایید کنترل کیفی", "status_type_id" => 5003],



        // وضعیت ثبت تراکنش انبار
        ["id" => 500100100, "caption" => "در انتظار ثبت تراکنش انبار(برگ خروج)", "status_type_id" => 5000], //
        ["id" => 500100200, "caption" => "تراکنش انبار ثبت شده(برگ خروج)", "status_type_id" => 5000], //
        ["id" => 500100300, "caption" => "تراکنش انبار ثبت نشده(برگ خروج)", "status_type_id" => 5000], //
        ["id" => 500100400, "caption" => "در حال ثبت تراکنش انبار (برگ خروج)", "status_type_id" => 5000], //


        ["id" => 5320001, "caption" => " خالی", "status_type_id" => 5320],
        ["id" => 5320002, "caption" => "پر موجود در انبار", "status_type_id" => 5320],
        ["id" => 5320003, "caption" => " در حال مصرف", "status_type_id" => 5320],
        ["id" => 5320004, "caption" => " پر شده در انتظار تحویل به انبار", "status_type_id" => 5320],
        ["id" => 5320005, "caption" => " پر در انتظار درجه بندی", "status_type_id" => 5320],
        ["id" => 5320006, "caption" => "پر در حال تکمیل", "status_type_id" => 5320],
        ["id" => 5320007, "caption" => "پر در انتظار تایید انبار", "status_type_id" => 5320],
        ["id" => 5320008, "caption" => "پر در انتظار مغایرت گیری", "status_type_id" => 5320],
        ["id" => 5320009, "caption" => "فروش رفته", "status_type_id" => 5320],
        ["id" => 5320010, "caption" => "خارج شده", "status_type_id" => 5320],
        ["id" => 5320011, "caption" => "رزور شده", "status_type_id" => 5320],
        ["id" => 5320012, "caption" => " پر در انتظار تغییر بسته بندی", "status_type_id" => 5320],
        ["id" => 5320013, "caption" => " پر در انتظار کنترل کیفیت", "status_type_id" => 5320],


        // جدول datetime
        ["id" => 510000100, "caption" => " معلق / عدم تایید ", "status_type_id" => 5100],
        ["id" => 510000200, "caption" => "تایید شده", "status_type_id" => 5100],
        ["id" => 510000300, "caption" => " ویرایش شده", "status_type_id" => 5100],
        // جدول worker
        ["id" => 510100100, "caption" => " معلق / عدم تایید ", "status_type_id" => 5101],
        ["id" => 510100200, "caption" => "تایید شده", "status_type_id" => 5101],
        ["id" => 510100300, "caption" => " ویرایش شده", "status_type_id" => 5101],

        // وضعیت ثبت تراکنش های مالی در نرم افزارهای مالی

        ["id" => 5103100, "caption" => " عدم نیاز به ثبت ", "status_type_id" => 5103],
        ["id" => 5103200, "caption" => "در انتظار بررسی", "status_type_id" => 5103],
        ["id" => 5103250, "caption" => " در انتظار ثبت تراکنش مالی ", "status_type_id" => 5103],

        ["id" => 5103300, "caption" => " ثبت موفق", "status_type_id" => 5103],
        ["id" => 5103400, "caption" => " ثبت با خطا ", "status_type_id" => 5103],
        ["id" => 5103600, "caption" => "عدم ثبت (قبلا تراکنش ثبت شده است) ", "status_type_id" => 5103],
        ["id" => 5103800, "caption" => "بررسی ناقص ", "status_type_id" => 5103],
        ["id" => 5103900, "caption" => "در انتظار بررسی مجدد ", "status_type_id" => 5103],
        ["id" => 5103950, "caption" => "بررسی شده", "status_type_id" => 5103],


        // وضعیت محاسبه مقدار ریالی فرم های انبار و ذخیر در جدول FormItemCurrency
        ["id" => 5104100, "caption" => "مقدار ریالی محاسبه شد", "status_type_id" => 5104],
        ["id" => 5104200, "caption" => " امکان محاسبه مقدار ریالی وجود ندارد", "status_type_id" => 5104],
        ["id" => 5104300, "caption" => " عدم نیاز به محاسبه", "status_type_id" => 5104],
        ["id" => 5104400, "caption" => " محاسبه نشده", "status_type_id" => 5104],


        // آیا بهای تمام شده به ازای تخصیص محاسبه شده یا در انتظار ورود اطلاعات مالی می باشد.(machine_allocation_actual_costs)
//        ["id" => 5105100, "caption" => "بهای تمام شده محاسبه شد", "status_type_id" => 5104],
        ["id" => 5105200, "caption" => " در انتظار ثبت اطلاعات مالی", "status_type_id" => 5104],
        ["id" => 5105300, "caption" => "اطلاعات مالی ثبت شده است", "status_type_id" => 5104],
        ["id" => 5105400, "caption" => "عدم نیاز به ثبت اطلاعات مالی", "status_type_id" => 5104],

        // جدول تعرفه
        ["id" => 520100100, "caption" => " عدم تایید", "status_type_id" => 5201],
        ["id" => 520100200, "caption" => "فعال", "status_type_id" => 5201],
        ["id" => 520100300, "caption" => "غیر فعال", "status_type_id" => 5201],
        ["id" => 520100510, "caption" => " تعریف تعرفه جدید", "status_type_id" => 5201],
        ["id" => 520100520, "caption" => "ویرایش اطلاعات", "status_type_id" => 5201],
        ["id" => 520100530, "caption" => "آپلود لیست", "status_type_id" => 5201],
        ["id" => 520100540, "caption" => "قیمت گذاری کالا", "status_type_id" => 5201],
        ["id" => 520100550, "caption" => "حذف یک ردیف از تعرفه", "status_type_id" => 5201],


        ["id" => 522000100, "caption" => " عدم تایید", "status_type_id" => 5220],
        ["id" => 522000200, "caption" => "فعال", "status_type_id" => 5220],
        ["id" => 522000300, "caption" => "غیر فعال", "status_type_id" => 5220],


        ["id" => 523000100, "caption" => " ثبت نشده ", "status_type_id" => 5230],
        ["id" => 523000200, "caption" => "ثبت شده", "status_type_id" => 5230],


        // جدول انبار گردانی
        ["id" => 524000100, "caption" => " ثبت نشده ", "status_type_id" => 5240],
        ["id" => 524000200, "caption" => "ثبت شده", "status_type_id" => 5240],

        ["id" => 524000301, "caption" => "  در انتظار شروع انبار گردانی", "status_type_id" => 5240],
        ["id" => 524000302, "caption" => "در حال انبار گردانی", "status_type_id" => 5240],
        ["id" => 524000303, "caption" => "در حال پردازش (اولیه)", "status_type_id" => 5240],
        ["id" => 524000304, "caption" => "در انتظار بررسی بسته بندی ها", "status_type_id" => 5240],

        ["id" => 524000311, "caption" => "در انتظار تاییدیه مرحله اول", "status_type_id" => 5240],
        ["id" => 524000312, "caption" => "در انتظار تاییدیه مرحله دوم", "status_type_id" => 5240],
        ["id" => 524000313, "caption" => "در انتظار تاییدیه مرحله سوم", "status_type_id" => 5240],

        ["id" => 524000321, "caption" => "در حال پردازش (نهایی)", "status_type_id" => 5240],
        ["id" => 524000322, "caption" => "تایید شده", "status_type_id" => 5240],
        ["id" => 524000323, "caption" => "عدم تایید", "status_type_id" => 5240],

        ["id" => 524000401, "caption" => "خوانده شده (داخل انبار)", "status_type_id" => 5240],
        ["id" => 524000402, "caption" => "خوانده شده (خارج از انبار)", "status_type_id" => 5240],
        ["id" => 524000403, "caption" => "خوانده نشده (داخل انبار)", "status_type_id" => 5240],
        ["id" => 524000404, "caption" => "خوانده شده (داخل انبار دیگر)", "status_type_id" => 5240],
        ["id" => 524000405, "caption" => "خوانده شده (کد نامعتبر)", "status_type_id" => 5240],
        ["id" => 524000406, "caption" => "خوانده شده (وضعیت نامعتبر)", "status_type_id" => 5240],
        ["id" => 524000407, "caption" => "خوانده نشده (وضعیت نامعتبر)", "status_type_id" => 5240],
        ["id" => 524000408, "caption" => "خوانده شده (در انتظار تایید انبار)", "status_type_id" => 5240],


        // وضعیت تخصیص کارت به ماشین
        ["id" => 5310001, "caption" => " معلق/ ثبت اولیه ", "status_type_id" => 5310],
        ["id" => 5310005, "caption" => " معلق/در انتظار تایید ", "status_type_id" => 5310],
        ["id" => 5310010, "caption" => " تخصیص جاری ", "status_type_id" => 5310],
        ["id" => 5310020, "caption" => " تخصیص خاتمه یافته ", "status_type_id" => 5310],
        ["id" => 5310030, "caption" => " تخصیص  کنسل شده ", "status_type_id" => 5310],
        ["id" => 5310040, "caption" => " تخصیص  رزور ", "status_type_id" => 5310],
        ["id" => 5310050, "caption" => " در انتظار تخصیص مجدد ", "status_type_id" => 5310],
        ["id" => 5310060, "caption" => " در انتظار شروع عملیات بعدی (در عملیات های پیوسته) ", "status_type_id" => 5310],

        // حذف
//        ["id" => 5310110, "caption" => "در انتظار شروع ستاب", "status_type_id" => 5310],
//        ["id" => 5310120, "caption" => "در انتظار شروع عملیات", "status_type_id" => 5310],
//        ["id" => 5310130, "caption" => "در انتظار پایان عملیات", "status_type_id" => 5310],
//        ["id" => 5310140, "caption" => "در انتظار انجام تنظیمات نهایی", "status_type_id" => 5310],

// وضعیت کارت  تخصیص پیمان
    // کد های تخصیص پیمان باید با
        // 5311 شروع می شد که به اشتباه با 5310 شروع شده،
        // لطفا در کد گذاری های بعدی این مطلب در نظر گرفته شود.
        [
            "id" => 5310102,
            "caption" => "در انتظار درخواست مواد اولیه",
            "status_type_id" => 5311,
            "main_status_id" => "500"
        ],
        [
            "id" => 5310103,
            "caption" => "در انتظار ارسال مواد اولیه",
            "status_type_id" => 5311,
            "main_status_id" => "500"
        ],
        [
            "id" => 5310104,
            "caption" => "در حال تولید توسط پیمانکار",
            "status_type_id" => 5311,
            "main_status_id" => "500"
        ],
        ["id" => 5310105, "caption" => "در انتظار ارسال محصول", "status_type_id" => 5311, "main_status_id" => "500"],
        ["id" => 5310106, "caption" => "خاتمه یافته", "status_type_id" => 5311, "main_status_id" => "520"],
        [
            "id" => 5310107,
            "caption" => "در انتظار هماهنگی دریافت مواد اولیه",
            "status_type_id" => 5311,
            "main_status_id" => "500"
        ],
        [
            "id" => 5310108,
            "caption" => "در انتظار تایید دریافت مواد اولیه",
            "status_type_id" => 5311,
            "main_status_id" => "500"
        ],
        [
            "id" => 5310109,
            "caption" => "خاتمه یافته (ردیف تخصیص) ",
            "status_type_id" => 5311,
            "main_status_id" => "500"
        ],
        // وضعیت های تخصیص کارت تامین (دریافت امانی ) به مشتری

        [
            "id" => 5312101,
            "caption" => "در انتظار ارسال مواد اولیه توسط مشتری",
            "status_type_id" => 5312,
            "main_status_id" => "500"
        ],
        [
            "id" => 5312102,
            "caption" => "خاتمه یافته",
            "status_type_id" => 5312,
            "main_status_id" => "500"
        ],
        // وضعت اتوماسیون اداری
        [
            "id" => 5250001,
            "caption" => "پیش نویس",
            "status_type_id" => 5250,
        ],
        [
            "id" => 5250002,
            "caption" => "در جریان",
            "status_type_id" => 5250,
        ],
        [
            "id" => 5250003,
            "caption" => "در انتظار تایید",
            "status_type_id" => 5250,
        ],
        [
            "id" => 5250004,
            "caption" => "خاتمه یافته",
            "status_type_id" => 5250,
        ],

        [
            "id" => 5250005,
            "caption" => "در انتظار تایید انجام کار",
            "status_type_id" => 5250,
        ],

        [
            "id" => 5250006,
            "caption" => "کنسل شده",
            "status_type_id" => 5250,
        ],
        [
            "id" => 5250011,
            "caption" => "در انتظار مشاهده",
            "status_type_id" => 5250,
        ],
        [
            "id" => 5250012,
            "caption" => "مشاهده شده",
            "status_type_id" => 5250,
        ],


        // جدول تنظیمات سیستم
        ["id" => 60010100, "caption" => " فعال", "status_type_id" => 6001],
        ["id" => 60010200, "caption" => "غیر فعال", "status_type_id" => 6001],


        // وضعیت تعمیرات و نگهداری ماشین
        ["id" => 6002001, "caption" => "عادی", "status_type_id" => 6002],
        ["id" => 6002002, "caption" => "در انتظار|در حال نگهداری و تعمیرات", "status_type_id" => 6002],

        // وضعیت تیکت های داشبورد نگهداری و تعمیرات
        ["id" => 6003001, "caption" => "در انتظار شروع", "status_type_id" => 6003],
        ["id" => 6003002, "caption" => "در حال انجام", "status_type_id" => 6003],
        ["id" => 6003003, "caption" => "خاتمه یافته", "status_type_id" => 6003],
        ["id" => 6003004, "caption" => "در انتظار تایید نت", "status_type_id" => 6003],
        ["id" => 6003005, "caption" => "در انتظار تایید درخواست کننده", "status_type_id" => 6003],
        ["id" => 6003006, "caption" => "عدم تایید نت", "status_type_id" => 6003],

        // وضعیت نقص های ماشین
        ["id" => 6004001, "caption" => "در انتظار تایید نقص", "status_type_id" => 6004],
        ["id" => 6004002, "caption" => "تایید شده", "status_type_id" => 6004],
        ["id" => 6004003, "caption" => "در انتظار تایید رفع نقص", "status_type_id" => 6004],
        ["id" => 6004004, "caption" => "رفع  نقص شده", "status_type_id" => 6004],


        ["id" => 6010001, "caption" => "ثبت موقت", "status_type_id" => 6010],
        ["id" => 6010002, "caption" => "ثبت نهایی", "status_type_id" => 6010],
        ["id" => 6010003, "caption" => "معلق ", "status_type_id" => 6010],
        ["id" => 6010101, "caption" => "در انتظار خروج از سازمان ", "status_type_id" => 6010],
        ["id" => 6010102, "caption" => "خارج شده از سازمان ", "status_type_id" => 6010],
        ["id" => 6010103, "caption" => "در حال بارگیری ", "status_type_id" => 6010],
        ["id" => 6010104, "caption" => "در انتظار ورود به سازمان ", "status_type_id" => 6010],
        ["id" => 6010105, "caption" => "وارد شده به سازمان ", "status_type_id" => 6010],
        ["id" => 6010106, "caption" => "مرجوع شده ", "status_type_id" => 6010],

        // تراکنش مصرف
        ["id" => 6020001, "caption" => "در انتظار ثبت مصرف", "status_type_id" => 6020],
        ["id" => 6020002, "caption" => "مصرف ثبت شده", "status_type_id" => 6020],
        ["id" => 6020003, "caption" => "کنسل شده به دلیل نداشتن تخصیص", "status_type_id" => 6020],
        ["id" => 6020004, "caption" => "مصرف صفر", "status_type_id" => 6020],
        ["id" => 6020005, "caption" => "خطا در ثبت تراکنش مصرف", "status_type_id" => 6020],

        // تراکنش مصرف اصلاحی
        ["id" => 6021001, "caption" => " در حال انجام (معلق)", "status_type_id" => 6021],
        ["id" => 6021002, "caption" => "در انتظار ثبت برگ خروج و فرم ورود", "status_type_id" => 6021],
        ["id" => 6021003, "caption" => " خاتمه یافته", "status_type_id" => 6021],
        ["id" => 6021004, "caption" => "در انتظار ثبت تراکنش های مصرف اصلاحی", "status_type_id" => 6021],
        ["id" => 6021005, "caption" => "در انتظار تایید/عدم تایید فرم های ورود به انبار", "status_type_id" => 6021],
        ["id" => 6021101, "caption" => "مصرف نشده", "status_type_id" => 6021],
        ["id" => 6021102, "caption" => " بخشی مصرف شده", "status_type_id" => 6021],
        ["id" => 6021103, "caption" => " کاملا مصرف شده", "status_type_id" => 6021],
        //پرادزش فرم های ورود برای تراکنش اصلاحی
        ["id" => 6021201, "caption" => "در انتظار پردازش تراکنش اصلاحی ", "status_type_id" => 6021],
        ["id" => 6021202, "caption" => "پردازش انجام شده", "status_type_id" => 6021],

        ["id" => 6021301, "caption" => "در انتظار محاسبه مصرف واقعی", "status_type_id" => 6021],
        ["id" => 6021302, "caption" => "مصرف واقعی محاسبه شده", "status_type_id" => 6021],
        ["id" => 6021303, "caption" => "امکان محاسبه مصرف واقعی در این فرم وجود ندارد.", "status_type_id" => 6021],

        // وضعیت گزارش های سامانه
        ["id" => 6030301, "caption" => "در انتظار بررسی درخواست", "status_type_id" => 6030],

        // وضعیت مجوزها
        ["id" => 6040001, "caption" => "در انتظار تایید مجوز", "status_type_id" => 6040],
        ["id" => 6040002, "caption" => "تایید شده", "status_type_id" => 6040],
        ["id" => 6040003, "caption" => "عدم تایید", "status_type_id" => 6040],
        ["id" => 6040201, "caption" => "در انتظار تایید خبره", "status_type_id" => 6040],
        ["id" => 6040202, "caption" => "تایید خبره", "status_type_id" => 6040],
        ["id" => 6040203, "caption" => "عدم تایید خبره", "status_type_id" => 6040],

        //وضعیت بهای تمام شده
        ["id" => 6060001, "caption" => "محاسبه شده", "status_type_id" => 6060],
        ["id" => 6060002, "caption" => "عدم امکان محاسبه", "status_type_id" => 6060],
        ["id" => 6060003, "caption" => "در انتظار  محاسبه", "status_type_id" => 6060],

        ["id" => 6060100, "caption" => "در انتظار ثبت اطلاعات مالی", "status_type_id" => 6060],

        // وضعیت ارسال بسته بندی های کالای امانی ثبت شده توسط مشتری

        ["id" => 6070001, "caption" => "در انتظار ارسال", "status_type_id" => 6070],
        ["id" => 6070002, "caption" => "ارسال شده", "status_type_id" => 6070],
        ["id" => 6070003, "caption" => "ثبت شده در تایید پیمانکار", "status_type_id" => 6070],

        // وضعیت پالت ها

        ["id" => 6080001, "caption" => " در حال پر شدن", "status_type_id" => 6080],
            ["id" => 6080002, "caption" => "  پر شده", "status_type_id" => 6080],
        ["id" => 6080003, "caption" => " تبدیل شده به بسته بندی حمل و نقل", "status_type_id" => 6080],

        // وضعیت کارت پیمان
        ["id" => 7008001, "caption" => "تخصیص پیمانکار", "status_type_id" => 7008],
        ["id" => 7008002, "caption" => "تولید توسط *** پیمانکار", "status_type_id" => 7008],
        ["id" => 7008003, "caption" => "خاتمه یافته - حذف ", "status_type_id" => 700800],
        ["id" => 7008004, "caption" => " هماهنگی جهت دریافت مواد اولیه", "status_type_id" => 7008],
        ["id" => 7008005, "caption" => " خاتمه یافته", "status_type_id" => 7008],
        ["id" => 7008006, "caption" => " تخصیص مجدد پیمانکار", "status_type_id" => 7008],

        // وضعیت کارت تامین مواد اولیه
        ["id" => 7011001, "caption" => "تخصیص مشتری", "status_type_id" => 7011],
        ["id" => 7011002, "caption" => "ارسال مواد اولیه", "status_type_id" => 7011],
        ["id" => 7011003, "caption" => "خاتمه یافته", "status_type_id" => 7011],

        // وضعیت فرم های مجوز بارگیری
        ["id" => 7015001, "caption" => "صدور مجوز", "status_type_id" => 7015],

        // وضعیت کارت خرید
        ["id" => 7012001, "caption" => "تخصیص تامین کننده", "status_type_id" => 7012],


        // وضعیت فرم مرجوعی کالا
        ["id" => 7009001, "caption" => "تایید شده", "status_type_id" => 7009],
        ["id" => 7009002, "caption" => "کنسل شده", "status_type_id" => 7009],
        ["id" => 7009003, "caption" => "در انتظار تایید (کنترل کیفیت)", "status_type_id" => 7009],
        ["id" => 7009004, "caption" => "در انتظار ورود به کارخانه(نگهبانی)", "status_type_id" => 7009],
        ["id" => 7009005, "caption" => "در انتظار تایید (انبار)", "status_type_id" => 7009],
        ["id" => 7009006, "caption" => "در انتظار بررسی (کنترل کیفیت)", "status_type_id" => 7009],
        ["id" => 7009007, "caption" => "در انتظار ارسال کالا (درخواست دهنده)", "status_type_id" => 7009],
        ["id" => 7009008, "caption" => "در انتظار تایید (کارشناس فروش)", "status_type_id" => 7009],
        ["id" => 7009009, "caption" => "عدم تایید", "status_type_id" => 7009],


        ["id" => 7010001, "caption" => "خاتمه یافته", "status_type_id" => 7010],


        // وضعیت جدا کننده seed و تعاریف کاربر
        ["id" => 900000000, "caption" => "نا معتبر ( جدا کننده)", "status_type_id" => 0],



    ];
    private $table = 'status';

    public function run()
    {
        DB::table($this->table)->where("id", ">", 0)->update(["caption" => "IncorrectStatus"]);
        foreach ($this->data as $item) {
            DB::table($this->table)->where("id", $item["id"])->delete();
            DB::table($this->table)->insert($item);
        }
        DB::table($this->table)->where("caption", "IncorrectStatus")->delete();

    }
}
