<?php

namespace Database\Seeders\OldSeeder;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class StatusTypeSeeder extends Seeder {
    private $data = [

        [ "id" => 100, "caption" => 'وضعیت ها در فایل سفارش نوسا ' ],
        [ "id" => 110, "caption" => 'وضعیت ها فعال بودن ' ],
        [ "id" => 200, "caption" => 'وضعیت فعال / غیر فعال بودن ' ],
        [ "id" => 300, "caption" => ' وضعیت در جدول new Order List ' ],

        [ "id" => 350, "caption" => 'وضعیت جدول Orders' ],
        [ "id" => 351, "caption" => 'وضعیت جدول Orders - سفارش گذاری' ],
        [ "id" => 352, "caption" => "وضعیت فرایند بارگیری" ],
        [ "id" => 304, "caption" => 'دریافت تاییده های سفارش' ],
        [ "id" => 305, "caption" => 'وضعیت پرینت فایل های ارسال شده به پرینتر' ],

        [ "id" => 380, "caption" => ' وضعیت در جدول  request_from_warehouse ' ],

        [ "id" => 400, "caption" => "وضعیت ماژول ها " ],
        [ "id" => 410, "caption" => "وضعیت اجرای اسکریپت  ها " ],
        [ "id" => 420, "caption" => "وضعیت وجود داشتن بسته در انبار " ],


        [ "id" => 500, "caption" => "وضعیت کارت تولید   " ],
        [ "id" => 50010, "caption" => "وضعیت  در انتظار(فرعی) کارت تولید   " ],
        [ "id" => 50011, "caption" => "لاگ سیستم برای کارت تولید " ],
        [ "id" => 50012, "caption" => "وضعیت کارت تولید رزرو " ],
        [ "id" => 550, "caption" => "وضعیت فرم تولید " ],
        [ "id" => 55010, "caption" => "وضعیت (فرعی) فرم تولید " ],

        [ "id" => 600, "caption" => "وضعیت بارگیری   " ],
        [ "id" => 650, "caption" => "وضعیت تاهل   " ],


        [ "id" => 1100, "caption" => "وضعیت فعال بودن محصول" ],

        [ "id" => 2001, "caption" => "وضعیت مشتری" ],
        [ "id" => 2002, "caption" => "وضعیت ثبت نام کاربران" ],

        [ "id" => 3300, "caption" => "وضعیت فراخوانی" ],
        [ "id" => 3310, "caption" => "وضعیت ایستگاه کاری" ],
        [ "id" => 3325, "caption" => "وضعیت  خط تولید" ],
        [ "id" => 3350, "caption" => "وضعیت تولید ماشین ها" ],
        [ "id" => 3355, "caption" => "وضعیت (فرعی) ماشین ها" ],
        [ "id" => 3358, "caption" => "وضعیت کانال تولید ماشین ها" ],
        [ "id" => 3359, "caption" => "وضعیت نیاز به تعویص ورودی های ماشین" ],
        [ "id" => 3400, "caption" => "وضعیت طراحی کالا" ],
        [ "id" => 3410, "caption" => "نوع پیش نیاز در مسیر محصول نسبت به مرحله قبل به عبارت دیگر آیا دو ماشین به صورت موازی با هم استارت می شوند یا به صورت سری" ],

        [ "id" => 3500, "caption" => "وضعیت صف عملیات های بزرگ" ],
        [ "id" => 3600, "caption" => "وضعیت پرداخت ها جهت شارژ پیامک و ... برای سامانه" ],


        [ "id" => 4400, "caption" => "سفارش خرید کالا - بازرگانی " ],
        [ "id" => 4500, "caption" => "خرید ماژول های سامانه " ],

        [ "id" => 4600, "caption" => "مجوز خروج انبار برای orders" ],
        [ "id" => 4610, "caption" => "مجوز ورود خروج کارکنان" ],


        [ "id" => 4620, "caption" => "وضعیت حضور کارکنان در سازمان " ],
        [ "id" => 4630, "caption" => "وضعیت مرخصی " ],
        [ "id" => 4640, "caption" => "وضعیت درخواست همکاری " ],
        [ "id" => 4641, "caption" => "وضعیت تایید اطلاعات گام ها در همکاری با ما " ],
        ["id" => 4642, "caption" => "وضعیت   تایید نمایندگی نماینده"],

        [ "id" => 4650, "caption" => "وضعیت ارزیابی عملکرد " ],


        [ "id" => 5000, "caption" => "وضعیت تایید فرم در forms" ],
        [ "id" => 5002, "caption" => "وضعیت ایتم های کلی FormGeneralItem" ],

        [ "id" => 5003, "caption" => "وضعیت کنترل کیفی ایتم های کلی FormGeneralItem" ],

        [ "id" => 5100, "caption" => "وضعیت تایید فرم در ProductionDateTime" ],
        [ "id" => 5101, "caption" => "وضعیت تایید فرم در ProductionWorker" ],

        [ "id" => 5103, "caption" => "وضعیت ثبت تراکنش در سامانه های مالی(به ازای هر فرم ورود/برگ خروج)" ],
        [ "id" => 5104, "caption" => "وضعیت محاسبه مقدار ریالی فرم های انبار و ذخیر در جدول FormItemCurrency" ],
        [ "id" => 5105, "caption" => "آیا بهای تمام شده به ازای تخصیص محاسبه شده یا در انتظار ورود اطلاعات مالی می باشد.(machine_allocation_actual_costs) " ],



        [ "id" => 5201, "caption" => "وضعیت تعرفه ها در سامانه" ],

        [ "id" => 5220, "caption" => "وضعیت تخفیف ها در سامانه" ],
        [ "id" => 5231, "caption" => "وضعیت فرم درخواست طراحی کالا" ],

        [ "id" => 5230, "caption" => "وضعیت ثبت xml سفارش در نوسا" ],
        [ "id" => 5240, "caption" => "انبار گردانی" ],
        [ "id" => 5245, "caption" => "مرکز هزینه" ],
        [ "id" => 5250, "caption" => "وضعیت های اتوماسیون اداری" ],


        [ "id" => 5300, "caption" => 'وضعیت روشن بودن ' ],
        [ "id" => 5310, "caption" => 'وضعیت تخصیص ماشین ' ],
        [ "id" => 5311, "caption" => 'وضعیت تخصیص پیمانکار ' ],
        [ "id" => 5312, "caption" => 'وضعیت تخصیص مشتری (کارت تامین (کالای امانی) ' ],

        [ "id" => 5320, "caption" => 'وضعیت حامل ها ' ],

        [ "id" => 6001, "caption" => "تنظیمات سیستم " ],
        [ "id" => 6002, "caption" => "وضعیت تعمیرات و نگهداری ماشین" ],
        [ "id" => 6003, "caption" => "وضعیت تیکت های تعمیرات و نگهداری" ],
        [ "id" => 6004, "caption" => "وضعیت نقص های ماشین" ],

        [ "id" => 6010, "caption" => "وضعیت بسته بندی حمل و نقل" ],
        [ "id" => 6020, "caption" => "ثبت مصرف مواد اولیه" ],
        [ "id" => 6021, "caption" => "تراکنش مصرف اصلاحی" ],
        [ "id" => 6030, "caption" => "وضعیت گزارش های سامانه" ],
//        [ "id" => 6040, "caption" => "وضعیت فرم های ورود به کارخانه" ],
        [ "id" => 6040, "caption" => "وضعیت مجوزها" ],
        [ "id" => 6060, "caption" => "وضعیت محاسبه بهای تمام شده" ],
        [ "id" => 6070, "caption" => "وضعیت ارسال بسته بندی های کالای امانی ثبت شده توسط مشتری" ],
        [ "id" => 6080, "caption" => "وضعیت پالت ها" ],

        // پیش فرض کد های هر ماژول
        [ "id" => 7001, "caption" => " کارت تولید پارچه خام " ],
        [ "id" => 7002, "caption" => " فرم تولید پارچه خام " ],
        [ "id" => 7003, "caption" => " ماشین های پارچه خام " ],
        [ "id" => 7004, "caption" => " طراحی در پارچه خام " ],

        [ "id" => 7005, "caption" => "ماژول درخواست کالا " ],
        [ "id" => 7006, "caption" => " وضعیت رکوردهای فرم درجه بندی پارچه FabricGrading" ],
        [ "id" => 7007, "caption" => " وضعیت فرم بسته بندی PackingForm" ],
        [ "id" => 7008, "caption" => " کارت پیمان " ],
        [ "id" => 7009, "caption" => " ماژول مرجوعی کالا " ],
        [ "id" => 7010, "caption" => "وضعیت های فرم خرید (فرم تولید)" ],
        [ "id" => 7011, "caption" => "کارت تامین مواد اولیه" ],
        [ "id" => 7012, "caption" => "کارت خرید مواد اولیه" ],
        [ "id" => 7015, "caption" => " مجوز های بارگیری انبار" ],

        [ "id" => 7102, "caption" => " فرم تولید پارچه تکمیل شده " ],

        [ "id" => 7201, "caption" => " کارت تولید چله کشی" ],
        [ "id" => 7202, "caption" => " فرم تولید چله کشی" ],
        [ "id" => 7203, "caption" => " ماشین های چله کشی" ],


        [ "id" => 7301, "caption" => " کارت تولید پارچه تکمیل شده " ],
        [ "id" => 7302, "caption" => " فرم تولید پارچه تکمیل شده " ],
        [ "id" => 7303, "caption" => " ماشین های پارچه تکمیل شده " ],


        //

    ];
    private $table = 'status_types';

    public function run() {
        DB::table( $this->table )->delete();
        foreach ( $this->data as $item ) {
            DB::table( $this->table )->insert( $item );
        }
    }
}
