<br/>
<div class="border-none">
    <table>

        <tr>
            <td style="text-align: right !important;">

                @if($text_footer_per_factor)
                    توضیحات:
                    <br/>
                    {!! nl2br(e($text_footer_per_factor)) !!}
                @endif


                @if( $order->customer->payment_terms)
                    <br/>
                    {!! nl2br(e($order->customer->payment_terms)) !!}
                @endif
                @if($order->customer->payment_terms_display_in_per_factor )
                    <br/>
                    شرایط پرداخت:

                    @include("customer.print._payment_method")

                @endif
                <br/>
                {{--                در صورتیکه اسناد پرداختی راس 3 ماه در برگ سفارش تایید شده توسط مشتری کارسازی نگردد, به ازای هر ماه تاخیر در پرداخت, ماهانه برای پارچه های دابی متری 50000 ریال و برای پارچه های ژاکارد متری 65000 ریال به مبلغ اضافه و خریدار متعهد به پرداخت آن میباشد.                <br/>--}}
                {{--                2.در صورت خرید چکی, چنانچه هر کدام از چک های پرداخت شده توسط خریدار به فروشنده به هر دلیلی قابل وصول نباشد و نسبت به آن گواهی عدم پرداخت صادر گردد, خریدار موظف است از تاریخ صدور گواهی عدم پرداخت ظرف مدت 20 روز وجه آن را به حساب فروشنده واریز و تسویه نماید, در غیر اینصورت خسارت مندرج در بند یک  در رابطه با خریدار مجری می باشد.--}}
                {{--                <br/>--}}
                {{--                3.ارائه فاکتور در برنامه واتساپ, روبیکا یا هر رسانه ی دیگر به منزله قبول طرح, قیمت,متراژ, درجه و عرض پارچه توسط خریدار و این اقرار به منزله ی تایید فاکتور می باشد و حق هر گونه اعتراضی از خریدار سلب و ساقط میگردد.--}}
                {{--                <br/>--}}
                {{--                4.اجناس بر اساس سفارش مشتری بوده و قابل برگشت نیستند.--}}
                {{--                <br/>--}}
                {{--                5.کلیه ی بند های ذیل فاکتور طبق ماده 10 قانون مدنی تنظیم گردیده است و برای طرفین لازم الاتباع می باشد.--}}

            </td>

        </tr>
        <tr>

            <td><br/><br/>
                <h3>مهر و امضا فروشنده:</h3></td>
            <td><h3>مهر و امضا خریدار:</h3></td>
        </tr>
    </table>
</div>
